/*=====================================================================
|
|   フェードヘッダー[fade.h]
|
|												作成者：大橋範顕
|												作成日：2024/09/18
======================================================================*/
#pragma once

#include "main.h"
#include"renderer.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitFade(void);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);

void FadeOut(void);
bool IsFadeOutFinish(void);
