/*=====================================================================
|
|   ピースヘッダー[piece.h]
|
|												作成者：大橋範顕
|												作成日：2024/09/02
======================================================================*/
#pragma once

#include "main.h"
#include"renderer.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPiece(void);
void UninitPiece(void);
void UpdatePiece(void);
void DrawPiece(void);
void CreatePiece(void);