/*=====================================================================
|
|   ランキングヘッダー[ranking.h]
|
|												作成者：大橋範顕
|												作成日：2024/09/03
======================================================================*/
#pragma once

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitRanking(void);
void UninitRanking(void);
void UpdateRanking(void);
void DrawRanking(void);

void AddRanking(int score);
