/*=====================================================================
|
|   スコアクラス[score.cpp]
|
|												作成者：大橋範顕
|												作成日：2024/09/03
======================================================================*/
#include"score.h"
#include "renderer.h"
#include "sprite.h"

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
static ID3D11ShaderResourceView* g_Texture = { NULL }; // テクスチャ―

/*******************************************************************************
*  グローバル変数
*******************************************************************************/
static int g_score;

/*******************************************************************************
*  初期化処理
*******************************************************************************/
void InitScore(void)
{
	//テクスチャ読み込み
	TexMetadata metadata;
	ScratchImage image;

	LoadFromWICFile(L"asset\\texture\\number.png", WIC_FLAGS_NONE, &metadata, image);
	CreateShaderResourceView(GetDevice(), image.GetImages(), image.GetImageCount(), metadata, &g_Texture);
	assert(g_Texture);

	g_score = 0;
}

/*******************************************************************************
*  終了処理
*******************************************************************************/
void UninitScore(void)
{
	//テクスチャの解放
	if (g_Texture)
	{
		g_Texture->Release();
		g_Texture = { NULL };
	}
}

/*******************************************************************************
*  更新処理
*******************************************************************************/
void UpdateScore(void)
{

}

/*******************************************************************************
*  描画処理
*******************************************************************************/
void DrawScore(void)
{
	GetDeviceContext()->PSSetShaderResources(0, 1, &g_Texture);

	int score = g_score;
	for (int i = 0; i < 3; i++) {
		DrawSpriteAnim(XMFLOAT2(200.0f - 60.0f * i, 200.0f), 0.0f, XMFLOAT2(100.0f, 100.0f), 5, 5, (score % 10));

		score /= 10;
	}
}


void AddScore(int score) {
	g_score += score;
}

int GetScore() {
	return g_score;
}

