/*=====================================================================
|
|   スコアヘッダー[score.h]
|
|												作成者：大橋範顕
|												作成日：2024/09/03
======================================================================*/
#pragma once

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitScore(void);
void UninitScore(void);
void UpdateScore(void);
void DrawScore(void);
void AddScore(int score);
int GetScore(void);